export default function Main() {
    return (
        <section style={{ padding: "12px", fontSize: "24px" }}>
            <h1>Головна сторінка</h1>
            <p>Ласкаво просимо на наш інтернет-магазин! Ми пропонуємо широкий вибір товарів для дому, електроніки, одягу та багато іншого. Насолоджуйтеся зручним шопінгом та швидкою доставкою прямо до вашого порогу.</p>
            <p>Завітайте до нашого каталогу, щоб знайти найкращі пропозиції та акції. Ми постійно оновлюємо асортимент, щоб ви могли знайти саме те, що шукаєте. Дякуємо, що обрали нас для своїх покупок!</p>
        </section>
    );
}